{
  "title": "Monikielinen sijoittajan apulainen",
  "error": "On tapahtunut virhe:",
  "home2": "Kirjautumisen lisäksi käyttöliittymä on monikielinen. Demossa on valittavana englanti, suomi ja ruotsi. Kirjautumista voi kokeilla:",
  "home3": "Käyttöliittymä on tehty Reactilla ja Typescriptillä, ja koristeltu Tailwind CSS:n avulla. React-Hookeista on käytössä mm useContext, useEffect, useLoaderData ja useReducer. Tyyli-funktioiden Pagestyle ja Warningstyle avulla HTML-koodin toistaminen on vähentynyt.",
  "explain": "Selitä",
  "instructions": "Ohjeet",
  "instruction1": "Kysy apulaiselta vuoden 2023 vuosikertomustietoja yhtiöistä:",
  "instruction2": "Aker, DnB, Huhtamäki, Nokia, Sandvik, Sanoma, Scania, Skanska, Telenor, UPM, Volvo, Yara.",
  "instruction3": "Apulainen ymmärtää toistaiseksi vain englantia.",
  "instruction4": "Hyvä kysymys:",
  "instruction5": "\"What are the main strategic goals of Sanoma?\"",
  "instruction6": "VAROITUS: Tämä sovellus on tarkoitettu vain esittelytarkoituksiin. ÄLÄ LUOTA sen antamiin vastauksiin!",
  "question": "Kysymys:",
  "send": "Lähetä",
  "clear": "Tyhjennä",
  "ex1q": "Mikä on tänä web-sovelluksen tarkoitus?",
  "ex1a": "Esittää miten ei-julkista tietoa voidaan hyödyntää AI-soveluksessa. Menetelmä tunnetaan nimellä Retrieval Augmmented Generation, jossa AI-kielimallin tietämyskantaan lisätään omia dokumentteja harhavastausten estämiseksi. Mentelmä on paljon halvempi ja nopeampi kuin olemassaolevan kielimallin hienosäätö tai oman kielimallin kehitys.",
  "ex2q": "Mitä AI/LLM/mallia/tms käytit?",
  "ex2a": "Kehityksen aikana käytössä oli Docker-kontissa ajettava Ollama, jossa chat-mallina oli Mistral ja embedding-mallina nomic-embed-text. Tämä instannsi pyörii Azure Spring Apps:issa jossa AI:na on Azure OpenAI ja mallina GPT 3.5 Turbo 4k.",
  "ex3q": "Hetkinen! Tarkoitatko että AI-kielimallia voi ajaa... vaikka omissa toimistokoneissamme?",
  "ex3a": "Juuri niin! Hyvä (= kallis) laitteisto tietysti parantaa käyttäjän kokemusta. Keskeinen huomio kuitenkin on, että AI-ympäristö voidaan kokonaan toteuttaa suljetussa verkossa. Arkaluontoista tietoa ei näin tarvitse lähettää avoimen verkon yli.",
  "ex4q": "Mitä muuta tekniikkaa on käytössä? Tarvitaanko lisää datatieteilijöitä?",
  "ex4a": "He voisivat varmasti parantaa vastausten laatua! Tämä sovellus on kuitenkin toteutettu pelkillä enterprise-Java komponenteilla. Se koostuu React-käyttöliittymästä ja Spring Boot -palvelimesta. Tämänkaltainen sovellus voidaan aika suoraviivaisesti yhdistää muihin enterprise-järjestelmiin, varsinkin jos ympäristössä on ennestään käytössä Java/Spring/Javascript.",
  "ex5q": "Miksi vuosikertomukset?",
  "ex5a": "Koska demoa varten on välttämätöntä kayttää uutta dataa jota nykyiset kielimallit eivät tunne. Nämä vuosikertomukset ovat tältä keväältä ja haettu suoraan ko yrityksen sivustosta.",
  "ex6q": "Onko sinulla sidoksia näihin yrityksiin?",
  "ex6a": "Ei. Ei minkäänlaisia. Yritykset tulivat valituiksi koska ovat aika hyvin tunnettuja, ja niiden vuosikertomukset olivat helposti saatavilla.",
  "ex7q": "Huomasin että apulaisen vastaukset ovat usein harhaanjohtavia, joskus täysin vääriä. Mistä tämä johtuu?",
  "ex7a": "Tärkeimmät tiedot vuosikertomuksissa on usein taulukoitu. PDF-tiedostoissa taulukkojen rakenteet voi olla varsin monenlaisia. Tämä on haastavaa tiedostoja sisäänlukevalle ohjelmalle, ja aiheuttaa suuren osan vastausten virheistä.",
  "ex8q": "Onko toiveita paremmasta?",
  "ex8a": "On. Ohjelmakirjastot kehittyvät nopeasti, ja parempia menetelmiä tiedostojen lukemiseen tulee saataville.",
  "ex9q": "Aiotko jatkaa tämän sovelluksen kehitystä?",
  "ex9a": "Aion. Esimerkiksi, oletan että vastausten laatua voisi parantaa käyttämällä graafitietokannan paremmin. Vuosikertomustiedot, missä muodossa ne sitten ovatkaan, voisi AI:n avulla luokitella sopivaan taksonomiaan, jota graafitietokanta voisi jäljitellä.",
  "ex10q": "Loistavaa! Miten sinut tavoittaa?",
  "ex10a1": "Jätä maili ",
  "ex10a2": " ja odota pikaista vastausta. Tosin, näin yksityisyrittäjänä, joskus on epäkäytännöllistä olla jatkuvasti tavoitettavissa.",
  "ttHomepage": "Kotisivulle",
  "ttClear": "Tyhjennä chat-historia",
  "schema": "Kaavio",
  "scA": "Järjestelmäkaavio",
  "scB": "Käytät sovelluksen tuotantoinstanssia, joka pyörii konttina Azure Spring Appsissa. AI-kielimallina on Azure OpenAI ja GPT 3.5 Turbo, ja graafitietokantana Neo4j AURA DB. Tekoäly ja tietokanta hoidetaan pilvipalveluilla jotta vältetään useamman Azure-kontin ajokustannukset.",
  "scC": "Kehitys tapahtuu Linux -työasemalla jossa on 32GB RAM ja GPU. Spring Boot -sovellus lukee PDF -tiedostoja ja lähettää niiden sisällön nlp-ingestorile JSON-paloiksi jäsentämistä varten. Spring Boot -sovellus järjestää JSON-palat puurakenteeksi. Kehityksessä sekä neo4j -tietokanta että Ollama -tekoälypalvelin ajetaan Docker -kontteina.",
  "sc1": "Spring Boot -sovellus käsittelee joukon PDF -dokumentteja ja lähettää niiden sisällön nlp-ingestorille.",
  "sc2": "nlp-ingestor pyörii Docker -kontissa. Se parseroi PDF-asiakirjan sisällön JSON -paloiksi, jotka se merkitsee otsikoiksi, taulukoiksi, taulukon riveiksi jne.",
  "sc3": "Spring Boot -sovellus vastaanottaa JSON -palat ja kokoaa niistä puurakenteen joka vastaa alkuperäisen PDF -dokumentin rakennetta.",
  "sc4": "Spring Boot -sovellus lataa asiakirjan palat neo4j -tietokantaan. Palojen tyypit kääntyvät neo4j:n elementeiksi, ja niiden keskinäiset relaatiot luodaan puurakenteesta.",
  "sc5": "Dokumentin tekstipalojen sulautukset luodaan AI-sulautusmallin avulla. Sulautukset talletetaan neo4j -tietokantaan. Relaatiot sulautuksista alkuperäkappaleisiinsa talletetaan myös neo4j:hin.",
  "sc6": "Käyttäjä (= sinä) voi lähettää kysymyksiä järjestelmään tämän React -käyttöliittymän avulla. Kysymys syötetään AI -järjestelmään, joka etsii samankaltaisia tekstipaloja neo4j -tietokannasta.",
  "sc7": "Samankaltaisimpien tekstipalojen pohjalta kielimalli muodostaa vastauksen ja palauttaa sen käyttäjälle.",
  "scD": "Graafitietokannan elementtien rakenne",
  "scE": "Neo4j tietokannan rakenne. Asiakirja (Document) koostuu otsikoista (Section), jotka voivat olla tekstiä (Chunk) tai taulukoita (Table). Toisin sanoen, Otsikko kuuluu Asiakirjaan, tai (aliotsikko) ylemmän tason Otsikkoon. Tekstit ja Taulut kuuluvat Otsikkoon, ja niillä on tekstisisällöstään muodostettuja sulautuksia (Embedding).",
  "scF": "Kiitokset",
  "scG": "Joshua Yu ja Ambit Shukla tekivät pohjatyöt ja julkaisivat ne GitHubissa.",
  "scH": ""
}
